22-Rails-Nested-Forms/cars-app/app/controllers/cars_controller.rb

SELECT "dealerships".* FROM "dealerships" WHERE "dealerships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cars".* FROM "cars" WHERE "cars"."dealership_id" = ?  [["dealership_id", 7]]
---
  def index
    if params[:dealership_id]
      dealership = Dealership.find(params[:dealership_id])
      @cars = dealership.cars
    else
      @cars = Car.all

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @car = Car.find(params[:id])

INSERT INTO "cars" ("make", "model", "year", "mileage", "created_at", "updated_at", "dealership_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["make", "Dodge"], ["model", "Challenger"], ["year", 2012], ["mileage", 6000], ["created_at", "2019-09-03 20:30:02.865570"], ["updated_at", "2019-09-03 20:30:02.865570"], ["dealership_id", 1]]
---
  def create
    # make = params[:car][:make]
    # model = params[:car][:model]
    # mileage = params[:car][:mileage]
    # year = params[:car][:year]
    car = Car.create(car_params)

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def edit
    @car = Car.find(params[:id])

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "cars" SET "mileage" = ?, "seats" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["mileage", 23000], ["seats", 5], ["updated_at", "2019-09-03 14:46:56.121979"], ["id", 4]]
---
  def update

    # find car to update
    car = Car.find(params[:id])
    # udpate it
    car.update(car_params)

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 4]]
---
  def destroy
    car = Car.find(params[:id])
    car.destroy