22-Rails-Nested-Forms/cars-app/app/controllers/dealerships_controller.rb

SELECT "dealerships".* FROM "dealerships"
---
  def index
    @dealerships= Dealership.all

SELECT "dealerships".* FROM "dealerships" WHERE "dealerships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @dealership = Dealership.find(params[:id])

INSERT INTO "dealerships" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Saul's Super Cars"], ["created_at", "2019-09-04 14:56:08.777860"], ["updated_at", "2019-09-04 14:56:08.777860"]]
---
  def create
    dealership = Dealership.create(dealership_params)