21-Rails-Associations/cars-app/app/views/dealerships/show.html.erb

<ul>
  <% @dealership.cars.each do |car| %>
---
SELECT "cars".* FROM "cars" WHERE "cars"."dealership_id" = ?  [["dealership_id", 1]]