28-Authorization/cars-app/app/controllers/application_controller.rb

  def current_user
    #memoization
    if @current_user
      return @current_user
    else
      # look in the request's cookies to see if this is a logged in user
      @current_user = User.find_by(username: session["user"])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "BGthaOG"], ["LIMIT", 1]]