28-Authorization/cars-app/app/views/cars/edit.html.erb


  <%= f.collection_select(:dealership_id, Dealership.all, :id, :name ) %>
---
SELECT "dealerships".* FROM "dealerships"