26-Cookies-and-Sessions/cars-app/app/controllers/application_controller.rb

  def current_user
    # look in the request's cookies to see if this is a logged in user
    @current_user = User.find_by(username: cookies["user"])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "BGthaOG"], ["LIMIT", 1]]