26-Cookies-and-Sessions/cars-app/app/controllers/dealerships_controller.rb

SELECT "dealerships".* FROM "dealerships"
---
  def index
    @dealerships= Dealership.all

SELECT "dealerships".* FROM "dealerships" WHERE "dealerships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @dealership = Dealership.find(params[:id])

INSERT INTO "dealerships" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Ourisman"], ["created_at", "2019-09-03 20:58:42.141025"], ["updated_at", "2019-09-03 20:58:42.141025"]]
---
  def create
    dealership = Dealership.create(self.dealership_params)