22-Rails-Nested-Forms/cars-app/app/views/dealerships/show.html.erb

SELECT "cars".* FROM "cars" WHERE "cars"."dealership_id" = ?  [["dealership_id", 1]]
---
<ul>
  <% @dealership.cars.each do |car| %>