20-Rails-RESTful-CRUD/cars-app/app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @car = Car.find(params[:id])

INSERT INTO "cars" ("make", "model", "mileage", "seats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["make", "Jeep"], ["model", "Cherokee"], ["mileage", 1], ["seats", 4], ["created_at", "2019-09-03 14:38:52.636421"], ["updated_at", "2019-09-03 14:38:52.636421"]]
---
  def create
    make = params[:car][:make]
    model = params[:car][:model]
    mileage = params[:car][:mileage]
    seats = params[:car][:seats]

    car = Car.create(make: make, model: model, mileage: mileage, seats: seats)

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @car = Car.find(params[:id])

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "cars" SET "mileage" = ?, "seats" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["mileage", 23000], ["seats", 5], ["updated_at", "2019-09-03 14:46:56.121979"], ["id", 4]]
---
  def update
    make = params[:car][:make]
    model = params[:car][:model]
    mileage = params[:car][:mileage]
    seats = params[:car][:seats]

    # find car to update
    car = Car.find(params[:id])
    # udpate it
    car.update(make: make, model: model, mileage: mileage, seats: seats)

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 4]]
---
  def destroy
    car = Car.find(params[:id])
    car.destroy