27-Authentication/cars-app/app/controllers/dealerships_controller.rb

  def index
    @dealerships= Dealership.all
---
SELECT "dealerships".* FROM "dealerships"

  def show
    @dealership = Dealership.find(params[:id])
---
SELECT "dealerships".* FROM "dealerships" WHERE "dealerships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    dealership = Dealership.create(self.dealership_params)
---
INSERT INTO "dealerships" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Ourisman"], ["created_at", "2019-09-03 20:58:42.141025"], ["updated_at", "2019-09-03 20:58:42.141025"]]