26-Cookies-and-Sessions/cars-app/app/views/cars/new.html.erb

SELECT "dealerships".* FROM "dealerships"
---

  <%= f.collection_select(:dealership_id, Dealership.all, :id, :name ) %>